# Task 1
# Напишіть скрипт, який виводить на екран усі числа в діапазоні від 1 до 100 кратні 7.
for n in range(1, 101):
    if n % 7 == 0:
        print(n)

# Task 2
# Напишіть скрипт для визначення суми цілих непарних чисел від 1 до 99 за допомогою оператора for. Використовуйте цілочисельні змінні summa і count.
summa = 0
i = 1
while i <= 99:
    if i % 2:
        summa += i
    i += 1
print(summa)

# Task 3
# Напишіть скрипт, який виводить цілі числа від 1 до 200, використовуючи цикл while. В одному рядку необхідно виведити лише п’ять цілих чисел.
# Наприклад,
# 1 2 3 4 5
# 6 7 8 9 10
# 11 12 13 14 15
# ...
i = 1
while i <= 200:
    print(i, end=' ' if i % 5 else '\n')
    i += 1

# Task 4
# Напишіть скрипт, який обчислює за допомогою циклу факторіал числа n (n вводиться з клавіатури).
n = int(input('n - '))
if n < 0:
    print('Invalid number')
else:
    f = 1
    while n > 1:
        f *= n
        n -= 1
    print(f)

# Task 5
# Напишіть скрипт, який виводить на екран таблицю множення на 5. Переважно друкувати 1 x 5 = 5, 2 x 5 = 10, а не просто 5, 10, ...
number = int(input('number = '))
i = 1
while i <= 10:
    print(f'{i} x {number} = {i * number}')
    i += 1

# Task 6
# Напишіть скрипт, який виводить на екран прямокутник із '*'. Висота і ширина прямокутника вводяться з клавіатури.  Наприклад, нижче представлений прямокутник з висотою 4 та шириною 5.
# *
# *   *
# *   *
# *
width = int(input('width = '))
height = int(input('height = '))
row = 1
while row <= height:
    if row == 1 or row == height:
        print('*' * width)
    else:
        print(f'*{' ' * (width - 2)}*')
    row += 1

# Task 7
# Є список [0, 5, 2, 4, 7, 1, 3, 19].
# Напишіть скрипт для підрахунку непарних цифр у ньому.
l = [0, 5, 2, 4, 7, 1, 3, 19]
count = 0
for i in l:
    if i % 2:
        count += 1
print(count)

# Task 8
# Створіть список випадкових чисел (розміром 4 елементи).
# Створіть другий список у два рази більше першого, де перші 4 елементи повинні дорівнювати елементам першого списку, а решта елементів - подвоєним значенням початкових.
# Наприклад,
# Було → [1,4,7,2]
# Стало → [1,4,7,2,2,8,14,4]
import random
l1 = [random.randint(1, 10) for _ in range(0, 4)]
l2 = []
for i in l1:
    l2.append(i * 2)
l2 = l1 + l2
print(l2)

# Task 9
# Створіть список із 12 елементів. Кожен елемент цього списку є зарплатою робітника за місяць. Виведіть цей список на екран та обчисліть середньомісячну зарплату цього робітника.
salary = [random.randint(1000, 10000) for _ in range(0, 12)]
print(salary)
print(f'AVG = {sum(salary) / len(salary):.2f}')

# Task 10
# Є матриця
# [1, 2, 3, 4]
# [5, 6, 7, 8]
# [9, 10, 11, 12]
# [13, 14, 15, 16]
# Напишіть скрипт, який виведе цю матрицю на екран, обчислить та виведе суму елементів цієї матриці.
matrix_size = int(input('matrix_size = '))
i = 1
matrix_sum = 0
while i <= matrix_size:
    tmp = [random.randint(1, 10) for _ in range(0, matrix_size)]
    print(tmp)
    matrix_sum += sum(tmp)
    i += 1
print('sum =', matrix_sum)

# Task 11
# Написати код для дзеркального перевороту списку [7,2,9,4] -> [4,9,2,7].
# Список може бути довільною довжиною.
count = int(input('list length = '))
l = [random.randint(1, 10) for _ in range(0, count)]
print(l)
print(l[::-1])

# Task 12
# За допомогою циклів вивести на екран усі прості числа від 1 до 100.
for n in range(1, 101):
    for j in range(2, n):
        if n % j == 0:
            break
    else:
        print(n)

# Task 13
# Виведіть на екран «пісочний годинник», максимальна ширина якого зчитується з клавіатури (число непарне). У прикладі ширина дорівнює 5.
# *****
#  ***
#   *
#  ***
# *****
width = int(input('width = '))
if width % 2:
    row = 0
    while row < width:
        if row <= width // 2:
            print(f'{' ' * row}{'*' * (width - row * 2)}{' ' * row}')
        else:
            tmp = width - row - 1
            print(f'{' ' * tmp}{'*' * (width - tmp * 2)}{' ' * tmp}')
        row += 1
else:
    print('Invalid width')