import math

# Task 1
# Привітання користувача. Напишіть Python-скрипт, який вітає користувача за його ім'ям.
# Ім'я вводить користувач з клавіатури за допомогою функції input, а потім виводиться привітання за допомогою функції print.
name = input('What is your name? ')
print('Hello,', name)

# Task 2
# Написати Python-скрипт, який для п'яти цілочисельних значень (вводить користувач з клавіатури), знаходить мінімум, максимум та середнє.
# Для пошуку мінімального та максимального значення потрібно використовувати функції min, max:
# https://docs.python.org/3/library/functions.html#max
# https://docs.python.org/3/library/functions.html#min
number1 = int(input('number1 '))
number2 = int(input('number2 '))
number3 = int(input('number3 '))
number4 = int(input('number4 '))
number5 = int(input('number5 '))
print('min ', min(number1, number2, number3, number4, number5))
print('max ', max(number1, number2, number3, number4, number5))

# Task 3
# Написати Python-скрипт, який буде повертати результат арифметичних дій +, -, *, /, // для заданих x та y (вводить користувач з клавіатури).
x = int(input('x = '))
y = int(input('y = '))
print(f'{x} + {y} = {x + y}')
print(f'{x} - {y} = {x - y}')
print(f'{x} * {y} = {x * y}')
print(f'{x} / {y} = {x / y}')
print(f'{x} // {y} = {x // y}')

# Task 4
# Написати Python-скрипт, який для кола заданого радіуса (вводить користувач з клавіатури) знаходить діаметр, довжину і площу окружності.
radius = int(input('radius = '))
print('diameter = ', 2 * radius)
print('circumference = ', 2 * math.pi * radius)
print('area = ', math.pi * (radius ** 2))

# Task 5
# Деякі інвестиційні консультанти вважають, що розумно очікувати 10% прибутку в довгостроковій перспективі на фондовому ринку.
# Припускаючи, що ви починаєте з 1000 доларів і залишаєте свої гроші інвестованими, обчисліть і відобразіть, скільки грошей ви матимете через 10, 20 і 30 років.
# Використовуйте наступну формулу для визначення цих сум:
# a = p(1 + r)^n
# де p — початкова інвестована сума (тобто основна сума 1000 доларів США),
# r – річна норма прибутку (10%),
# n - кількість років (10, 20 або 30),
# a — сума на депозиті на кінець n-го року.
amount = int(input('amount = '))
print('after 10 years - ', amount * (1 + 0.1) ** 10)
print('after 20 years - ', amount * (1 + 0.1) ** 20)
print('after 30 years - ', amount * (1 + 0.1) ** 30)

# Додаткові задачі
# Task 6
# Створіть скрипт-конвертер валюти, який запитує у користувача суму в доларах і переводить її в гривні згідно поточного обмінного курсу. Обмінний курс можна вказати в програмі.
dollars = int(input('dollars = '))
rate = 41
print(f'{dollars} USD = {rate * dollars} UAH (rate: {rate})')

# Task 7
# Написати скрипт, яких тризначне ціле число (вводить користувач з клавіатури) розділяє на окремі цифри. Кожну цифру треба вивести в окремому рядку.
# Наприклад, якщо користувач вводить число 987, скрипт має вивести в термінал
# 9
# 8
# 7
number = int(input('number = '))
print(number // 100)
print(number // 10 % 10)
print(number % 10)